In [1]:
import pymysql

In [2]:
myConnection = pymysql.connect( host='localhost', 
                               user='vikram', 
                               passwd='123',
                               db='hr_emp' )

In [3]:
cur = myConnection.cursor()

In [4]:
cur.execute("SELECT * FROM employees where manager_id = 3")
myresult = cur.fetchall()  
print(myresult)

((4, 'Abhishek', 'Sharma', 'ASHARMA', '901.765.7869', datetime.date(1996, 1, 30), 'FI_MGR', Decimal('15000.00'), None, 3, 70), (5, 'Bhuvan', 'Bhosle', 'BBHOSLE', '999.673.9878', datetime.date(1982, 5, 1), 'FI_MGR', Decimal('13000.00'), None, 3, 70), (6, 'Danny', 'Devgan', 'DDEVGAN', '902.876.9498', datetime.date(1987, 6, 12), 'FI_MGR', Decimal('11000.00'), None, 3, 70), (7, 'Velur', 'Patel', 'VPATEL', '987.654.9765', datetime.date(1992, 2, 27), 'FI_MGR', Decimal('16000.00'), None, 3, 70), (8, 'Akshay', 'Upadhyay', 'AUPADHYAY', '922.354.9786', datetime.date(1981, 3, 18), 'FI_MGR', Decimal('13500.00'), None, 3, 70), (91, 'Tiffani', 'Jacobs', 'TJACOBS', '543.785.8675', datetime.date(2000, 6, 23), 'MK_MAN', Decimal('9500.00'), None, 3, 52), (92, 'Rohit', 'Dhawan', 'RDHAWAN', '867.978.9865', datetime.date(1989, 1, 25), 'MK_MAN', Decimal('17600.00'), None, 3, 52), (93, 'Sakshi', 'Reddy', 'SREDDY', '978.756.8674', datetime.date(1997, 9, 9), 'MK_MAN', Decimal('20000.00'), None, 3, 52))

In [6]:
cur.execute("select e.employee_id, e.first_name, e.last_name, e.department_id,e.salary, d.department_name \
            from employees e inner join departments d \
            on e.department_id = d.department_id;")
cur.fetchmany(5)

((9, 'Nitin', 'Gautam', 10, Decimal('4700.00'), 'Human Resources'),
 (10, 'Abhishek', 'Fandnavis', 10, Decimal('5700.00'), 'Human Resources'),
 (11, 'Jack', 'Carle', 10, Decimal('9300.00'), 'Human Resources'),
 (12, 'Ishan', 'Malik', 10, Decimal('9100.00'), 'Human Resources'),
 (13, 'Usmaan', 'Sheikh', 10, Decimal('7700.00'), 'Human Resources'))

In [7]:
import pandas as pd

In [8]:
SQL_Query = pd.read_sql_query('SELECT * FROM employees where manager_id = 3', myConnection)

C:\Users\91981\AppData\Local\Temp\ipykernel_5016\3686077838.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  SQL_Query = pd.read_sql_query('SELECT * FROM employees where manager_id = 3', myConnection)

In [9]:
type(SQL_Query)

pandas.core.frame.DataFrame

In [10]:
SQL_Query1 = pd.read_sql_query("select e.employee_id, e.first_name, e.last_name, e.department_id, d.department_name \
            from employees e inner join departments d \
            on e.department_id = d.department_id", myConnection)

C:\Users\91981\AppData\Local\Temp\ipykernel_5016\695234650.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  SQL_Query1 = pd.read_sql_query("select e.employee_id, e.first_name, e.last_name, e.department_id, d.department_name \

In [11]:
SQL_Query1

     employee_id first_name  last_name  department_id  department_name
0              9      Nitin     Gautam             10  Human Resources
1             10   Abhishek  Fandnavis             10  Human Resources
2             11       Jack      Carle             10  Human Resources
3             12      Ishan      Malik             10  Human Resources
4             13     Usmaan     Sheikh             10  Human Resources
..           ...        ...        ...            ...              ...
96            16     Gaurav     Sharma             99          Payroll
97            17     Sheikh      Hamza             99          Payroll
98            18    Hussain      Malik             99          Payroll
99            19     Gustav       Khan             99          Payroll
100           20      Karan   Malhotra             99          Payroll

[101 rows x 5 columns]

In [12]:
myConnection.close()

In [13]:
import mysql
from mysql import connector
from mysql.connector import connect

In [ ]:
demodb = connect(
  host="localhost",
  user="vikram",
  password="123"
)

print(demodb)
demoCursor = demodb.cursor()
demoCursor.execute("CREATE DATABASE demo_db")

In [6]:
demodb = connect(
  host="localhost",
  user="vikram",
  password="123",
  database = "demo_db"
)

demoCursor = demodb.cursor()

In [206]:
demoCursor.execute("DROP TABLE Customers")

In [207]:
crt_table = """
CREATE TABLE Orders(
      OrderID INT, 
      CustomerID VARCHAR(200),
      OrderDate VARCHAR(200)
      );
      """

In [208]:
demoCursor.execute(crt_table)
demoCursor.execute("SHOW TABLES")
for x in demoCursor:
    print(x)

('orders',)

In [209]:
demoCursor.execute("DESCRIBE Orders")
for x in demoCursor:
    print(x)

('OrderID', b'int', 'YES', '', None, '')
('CustomerID', b'varchar(200)', 'YES', '', None, '')
('OrderDate', b'varchar(200)', 'YES', '', None, '')

In [210]:
import csv
import re

generate_list = []

with open("data.csv",mode="r") as csvFile:
    csv_reader = csv.reader(csvFile)
    
 
    fline = next(csv_reader)

    for row in csv_reader: 
        generate_list.append(tuple(row))

print(generate_list)

[('10308', '2', '18-09-1996'), ('10309', '37', '19-09-1996'), ('10310', '77', '20-09-1996')]

In [211]:
demoCursor.execute("TRUNCATE TABLE Orders")
demoCursor.execute("SELECT * FROM Orders")
for x in demoCursor:
    print(x)

In [213]:
sql = "INSERT INTO Orders (OrderID,CustomerID,OrderDate) VALUES (%s, %s, %s)"

demoCursor.executemany(sql, generate_list)

In [214]:
demodb.commit()

print(demoCursor.rowcount, "was inserted.")

3 was inserted.

In [216]:
demoCursor.execute("SELECT * FROM Orders")
for x in demoCursor:
    print(x)

(10308, '2', '18-09-1996')
(10309, '37', '19-09-1996')
(10310, '77', '20-09-1996')

In [203]:
# demoCursor.execute("UPDATE Customers SET OrderDate = STR_TO_DATE(OrderDate, '%d-%m-%Y');")

In [218]:
demoCursor.execute("ALTER TABLE Orders MODIFY OrderID INT")

In [219]:
demoCursor.execute("SELECT * FROM Orders")
for x in demoCursor:
    print(x)

(10308, '2', '18-09-1996')
(10309, '37', '19-09-1996')
(10310, '77', '20-09-1996')